// pages/mine/aboutMe/aboutMe.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [{
      time: "2022-09-02",
      con: "完了了项目立项以及组内分工"
    },{
      time: "2021-09-09",
      con: "增添了首页界面"
    },{
      time: "2021-09-13",
      con: "实现了点餐界面和在线支付功能"
    },{
      time: "2021-09-20",
      con: "支持管理员修改点餐界面菜品信息"
    },{
      time: "2021-09-27",
      con: "实现了用户我的功能界面"
    },{
      time: "2021-09-04",
      con: "完成了系统测试"
    },{
      time: "2021-09-10",
      con: "项目完成"
    }
  ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})